; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v6 - type_1 ?v4 - type_3)
 	      (pred_4 ?v8 - object ?v4 - type_3)
	      (pred_1 ?v6 - type_1 ?v3 - type_2)
	      (pred_2 ?v6 - type_1 ?v8 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v6 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_3 ?v6 ?v5))
       :effect (and  (pred_3 ?v6 ?v2)
		     (not (pred_3 ?v6 ?v5))))

   (:action op_3
       :parameters (?v6 - type_1 ?v1 - object ?v7 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v7) (pred_3 ?v6 ?v7) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v7)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_1 ?v1 - object ?v7 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v1 ?v3) (pred_3 ?v6 ?v7))
       :effect (and (pred_4 ?v1 ?v7)
		    (pred_1 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v1 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_04 obj_06 - type_2
obj_10 obj_01 obj_03 obj_07 - type_3
obj_02 obj_05 obj_09 - object)
(:init
(pred_3 obj_08 obj_03)
(pred_1 obj_08 obj_04)
(pred_1 obj_08 obj_06)
(pred_4 obj_02 obj_01)
(pred_4 obj_05 obj_03)
(pred_4 obj_09 obj_01)
)
(:goal
(and
(pred_4 obj_02 obj_07)
(pred_4 obj_05 obj_10)
(pred_4 obj_09 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_06))))
)
)

; plan
1. (op_3 obj_08 obj_05 obj_03 obj_04)
   deleted: (pred_4 obj_05 obj_03) (pred_1 obj_08 obj_04)
   added: (pred_2 obj_08 obj_05 obj_04)
   goals met: 1 of 3
2. (op_2 obj_08 obj_03 obj_10)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_10)
   goals met: 1 of 3
3. (op_1 obj_08 obj_05 obj_10 obj_04)
   deleted: (pred_2 obj_08 obj_05 obj_04)
   added: (pred_4 obj_05 obj_10) (pred_1 obj_08 obj_04)
   goals met: 2 of 3
4. (op_2 obj_08 obj_10 obj_01)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 3
5. (op_3 obj_08 obj_02 obj_01 obj_04)
   deleted: (pred_4 obj_02 obj_01) (pred_1 obj_08 obj_04)
   added: (pred_2 obj_08 obj_02 obj_04)
   goals met: 2 of 3
6. (op_2 obj_08 obj_01 obj_07)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_07)
   goals met: 2 of 3
7. (op_1 obj_08 obj_02 obj_07 obj_04)
   deleted: (pred_2 obj_08 obj_02 obj_04)
   added: (pred_4 obj_02 obj_07) (pred_1 obj_08 obj_04)
   goals met: 3 of 3
